tap "ariga/tap"
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "wader/tap"
tap "whatpulse/whatpulse"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful command-line bookmark manager
brew "buku"
# Arbitrary precision calculator
brew "calc"
# Statistics utility to count lines of code
brew "cloc"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Plays typewriter sounds every time you press a key
brew "daktilo"
# Display graphs and colors of file system space/usage
brew "dfc"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Source code tag system
brew "global"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Improved colored diff
brew "icdiff"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Platform built on V8 to build network applications
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Modern Python package and dependency manager supporting the latest PEP standards
brew "pdm"
# Python package management tool
brew "poetry"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Log file highlighter
brew "tailspin"
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Program that allows you to count code, quickly
brew "tokei"
# Source code spell checker
brew "typos-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja", args: ["HEAD"]
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi", args: ["HEAD"]
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Send any size file between devices
cask "blip"
# Web browser focusing on privacy
cask "brave-browser@beta"
# AI chatbot for many LLMs
cask "chatwise"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerised applications and microservices
cask "docker"
# English dictionary
cask "eudic"
# Web browser
cask "firefox-developer-edition"
# Screen colour temperature controller
cask "flux"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-maple-mono-nf-cn"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-zed-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Web browser
cask "google-chrome"
# Note-taking tool for visual learning
cask "heptabase"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Free and open-source RSS reader
cask "netnewswire@beta"
# Calculator and converter application
cask "numi"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Time optimising application
cask "rescuetime"
# Hardware-accelerated GPU terminal emulator
cask "rio"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF reader and note-taking application
cask "skim"
# Rime input method engine
cask "squirrel"
# Break time reminder app
cask "stretchly"
# Cloud video conferencing
cask "tencent-meeting"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# System tray app for automatic time tracking
cask "wakatime"
# Rust-based terminal
cask "warp"
# Messaging and calling application
cask "wechatwork"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "Save to Raindrop.io", id: 1549370672
mas "SnippetsLab", id: 1006087419
mas "Swift Playground", id: 1496833156
mas "TestFlight", id: 899247664
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
