# Created by `brew bundle dump`
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "autojump"
brew "bat"
brew "calc"
brew "cloc"
brew "curl"
brew "dfc"
brew "diff-so-fancy"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "httpie"
brew "icdiff"
brew "jq"
brew "jrnl"
brew "lolcat"
brew "lsd"
brew "macvim"
brew "minikube"
brew "neofetch"
brew "node"
brew "rust"
brew "starship"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "wget"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-native-comp"]
cask "1password"
cask "alfred"
cask "anki"
cask "coconutbattery"
cask "docker"
cask "dropbox"
cask "eudic"
cask "finicky"
cask "firefox-developer-edition"
cask "flux"
cask "font-droid-sans-mono-nerd-font"
cask "google-chrome"
cask "hyperswitch"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mweb-pro"
cask "paw"
cask "rectangle"
cask "rescuetime"
cask "stats"
cask "telegram"
cask "visual-studio-code"
cask "vivaldi"
cask "vmware-fusion"
